---
title: FormatValueOptions
classe: Autodesk.Revit.DB.FormatValueOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# FormatValueOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean AppendUnitSymbol { get; set; }` | `formatValueOptions.AppendUnitSymbol` | Boolean |
| `Boolean IsValidObject { get; }` | `formatValueOptions.IsValidObject` | Boolean |
| `Void Dispose()` | `formatValueOptions.Dispose()` | Void |
| `FormatOptions GetFormatOptions()` | `formatValueOptions.GetFormatOptions()` | FormatOptions |
| `Void SetFormatOptions(FormatOptions)` | `formatValueOptions.SetFormatOptions(formatOptions)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```